# 需要 sudo 授权，所以提到前面

cask "logitech-options"
cask "rode-central"
cask "squirrel-app"

brew "ffmpeg"
brew "gnupg"
brew "htop"
brew "http-server"
brew "just"
brew "mas"
brew "mole"
brew "node"
brew "ollama"
brew "pnpm"
brew "tree"

cask "1password"
cask "android-platform-tools"
cask "anki"
cask "blender"
cask "brave-browser"
cask "charles"
cask "chatgpt"
cask "chatwise"
cask "cleanshot"
cask "devonthink"
cask "downie"
cask "iina"
cask "insomnia"
cask "iterm2"
cask "jetbrains-toolbox"
cask "keyboard-maestro"
cask "netnewswire"
cask "obsidian"
cask "orbstack"
cask "raycast"
cask "skim"
cask "sublime-text"
cask "telegram"


# 并非每个电脑都安装
# cask "calibre"
# cask "qbittorrent"
# cask "wireshark"
# cask "ppduck"


############################################################
# mas 应用是跟随苹果账号的，如果id并不符合当前登录的账号，则无法安装 #
############################################################

mas "Adobe Lightroom", id: 1451544217
mas "Blackmagic Disk Speed Test", id: 425264550
mas "DaVinci Resolve", id: 571213070
mas "Drafts", id: 1435957248
mas "Infuse", id: 1136220934
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "The Unarchiver", id: 425424353
mas "WeChat", id: 836500024
