# brew "ffmpeg"

# 需要 sudo 授权，所以提到前面

cask "logitech-options"
cask "rode-central"
cask "squirrel-app"

brew "gpg"
brew "htop"
brew "node"
brew "http-server"
# brew "jq"
brew "just"
brew "mas"
brew "pnpm"
brew "tree"

cask "1Password"
cask "android-platform-tools"
cask "anki"
cask "blender"
cask "brave-browser"
cask "charles"
cask "chatgpt"
cask "chatWise"
cask "cleanShot"
cask "devonthink"
cask "downie"
cask "iina"
cask "insomnia"
cask "iterm2"
cask "jetbrains-toolbox"
cask "keyboard-maestro"
cask "NetNewsWire"
cask "obsidian"
cask "ollama"
cask "Raycast"
cask "skim"
cask "sublime-text"
cask "telegram"


# 并非每个电脑都安装
# cask "calibre"
# cask "qbittorrent"
# cask "wireshark"
# cask "Ppduck"


############################################################
# mas 应用是跟随苹果账号的，如果id并不符合当前登录的账号，则无法安装 #
############################################################
mas "DaVinci Resolve", id: 571213070
mas "Drafts", id: 1435957248
# mas "Keynote", id: 409183694
mas "Adobe Lightroom", id: 1451544217
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "The Unarchiver", id: 425424353
mas "WeChat", id: 836500024

# 刘海屏的 mac，可以使用这个软件隐藏状态栏
# mas "Hidden Bar", id:1452453066