tap "homebrew/bundle"
brew "htop"
brew "node"
brew "http-server"
brew "jq"
brew "just"
brew "mas"
brew "pnpm"
brew "pyenv"
brew "pyenv-virtualenv"
brew "tree"
brew "yarn"

cask "arc"
cask "cleanshot"
cask "devonthink"
cask "iina"
cask "iterm2"
cask "jetbrains-toolbox"
cask "keyboard-maestro"
cask "logitech-options"
cask "obsidian"
cask "postman"
cask "ppduck"
cask "qbittorrent"
cask "raycast"
cask "resilio-sync"
cask "skim"
cask "sourcetree"
cask "squirrel"
cask "sublime-text"
cask "telegram"
cask "textexpander"
cask "wireshark"

mas "1Password 7", id: 1333542190
mas "Drafts", id: 1435957248
mas "Fantastical", id: 975937182
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Paste", id: 967805235
mas "WeChat", id: 836500024
